<template>
    <div class="main flex-col">
        <div v-if="modalDisplay" class="contact-modal">
            <div class="modal-body flex-row">
                <div class="modal-exit" @click="modalDisplay = false">
                    <svg style="cursor: pointer;" width="15" height="15" viewBox="0 0 15 15" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <g clip-path="url(#clip0)">
                    <path d="M14.493 2.95446L9.94808 7.49984L14.493 12.045C15.169 12.7213 15.169 13.8168 14.493 14.4931C14.1552 14.8309 13.7124 14.9999 13.2697 14.9999C12.8264 14.9999 12.3835 14.8311 12.0459 14.4931L7.50003 9.9474L2.95447 14.493C2.61673 14.8308 2.17384 14.9998 1.73081 14.9998C1.28792 14.9998 0.845322 14.8311 0.507284 14.493C-0.16875 13.8171 -0.16875 12.7215 0.507284 12.045L5.05207 7.49979L0.507026 2.95446C-0.169009 2.27843 -0.169009 1.18267 0.507026 0.506637C1.18293 -0.168879 2.27805 -0.168879 2.95421 0.506637L7.49999 5.05202L12.0454 0.506637C12.7217 -0.168879 13.817 -0.168879 14.4927 0.506637C15.169 1.18267 15.169 2.27843 14.493 2.95446Z" fill="#4985FF"/>
                    </g>
                    <defs>
                    <clipPath id="clip0">
                    <rect width="15" height="15" fill="white"/>
                    </clipPath>
                    </defs>
                    </svg>
                </div>
                <div class="modal-left flex-col">
                    <div class="ml-head">Связаться с нами</div>
                    <div class="ml-sub">Мы с радостью готовы Вам помочь!</div>
                    <div class="ml-contacts flex-row">
                        <div class="contact flex-col">
                            <div class="label">Горячая линия:</div>
                            <a class="value">+7 (727) 250-30-20</a>
                        </div>
                        <div class="contact flex-col">
                            <div class="label">Режим работы:</div>
                            <a class="value">Ежедневно с 10:00 до 19:00</a>
                        </div>
                        <div class="contact flex-col">
                            <div class="label">E-mail почта:</div>
                            <a class="value">Daris_info@gmail.com</a>
                        </div>
                    </div>
                    <div class="ml-back" @click="modalDisplay = false">Вернутся на главную</div>
                </div>
                <div class="modal-right">
                    <img src="/images/contact-modal.png" alt="">
                </div>
            </div>
        </div>
        <div v-if="sideMenu" class="side-menu flex-row">
            <div class="side-left flex-col">
                <div class="side-top flex-row">
                    <div @click="$router.push({ name: 'home' })" class="logo">
                        <img src="/images/logo.png"/>
                    </div>
                    <div class="slogan">Экономим ваше время!</div>
                </div>
                <div class="side-slogan">Экономим ваше время!</div>
                <div class="side-head">О компании</div>
                <div class="side-text">Аутсорсинговая компания, оказывающая широкий спектр услуг по заключению Договоров и выполнению взаиморасчетов за оказанные Услуги. </div>
                <div class="side-btns flex-row">
                    <div id="lang-us-sm" class="lang-us flex-row" @click="showCountrySmall = showCountrySmall ? false : true">
                        <svg style="margin: 12px 0 auto 15px;" width="14" height="14" viewBox="0 0 14 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <g clip-path="url(#clip0)">
                        <path d="M8.98866 10.0529C8.9334 9.98745 8.8511 9.94971 8.7645 9.94971H5.23601C5.14941 9.94971 5.0671 9.98745 5.01184 10.0529C4.95631 10.1183 4.9335 10.2045 4.94917 10.2881C5.36846 12.5178 6.17368 13.9585 7.00025 13.9585C7.82683 13.9585 8.63205 12.5178 9.05131 10.2881C9.06698 10.2045 9.0442 10.1183 8.98866 10.0529Z" fill="#4985FF"/>
                        <path d="M13.6672 4.995C13.6288 4.87643 13.5166 4.7959 13.3895 4.7959H10.1052C10.0229 4.7959 9.94426 4.83002 9.88899 4.89012C9.83346 4.95025 9.80669 5.03049 9.81495 5.11102C9.88246 5.7687 9.91664 6.43366 9.91664 7.08658C9.91664 7.73951 9.88246 8.40447 9.81495 9.06215C9.80669 9.14268 9.83346 9.22294 9.88899 9.28305C9.94426 9.34318 10.0229 9.37727 10.1052 9.37727H13.3896C13.5166 9.37727 13.6288 9.29674 13.6673 9.17817C13.888 8.49955 13.9999 7.79602 13.9999 7.08661C13.9999 6.3772 13.888 5.67367 13.6672 4.995Z" fill="#4985FF"/>
                        <path d="M9.66082 3.98433C9.68447 4.12217 9.8061 4.22313 9.94851 4.22313H12.8925C12.9953 4.22313 13.0908 4.16971 13.1435 4.08303C13.1959 3.99606 13.1979 3.88841 13.1486 3.79977C12.273 2.22462 10.7688 1.02477 9.02109 0.508017C8.90857 0.473899 8.78467 0.511641 8.70978 0.602536C8.63543 0.693698 8.6246 0.819812 8.68243 0.921578C9.10738 1.66929 9.44576 2.72824 9.66082 3.98433Z" fill="#4985FF"/>
                        <path d="M8.93306 4.7959H5.06562C4.91665 4.7959 4.79161 4.90607 4.77566 5.05148C4.70304 5.71252 4.66602 6.39731 4.66602 7.08662C4.66602 7.77592 4.70304 8.46071 4.77566 9.12175C4.79161 9.26716 4.91665 9.37733 5.06562 9.37733H8.93306C9.08203 9.37733 9.20707 9.26716 9.22301 9.12175C9.29564 8.46071 9.33266 7.77592 9.33266 7.08662C9.33266 6.39731 9.29564 5.71252 9.22301 5.05148C9.20707 4.90607 9.08203 4.7959 8.93306 4.7959Z" fill="#4985FF"/>
                        <path d="M1.10809 4.22321H4.05211C4.19452 4.22321 4.31614 4.12227 4.3398 3.9844C4.55485 2.72831 4.89323 1.66937 5.31818 0.92165C5.37601 0.819857 5.36519 0.693744 5.29084 0.602608C5.21622 0.512009 5.09287 0.473703 4.97953 0.50809C3.2318 1.02487 1.72759 2.22472 0.852017 3.79987C0.802744 3.88851 0.80474 3.99619 0.857158 4.08313C0.909849 4.16981 1.00525 4.22321 1.10809 4.22321Z" fill="#4985FF"/>
                        <path d="M4.11097 9.28305C4.1665 9.22292 4.19327 9.14269 4.18502 9.06215C4.1175 8.40447 4.08332 7.73952 4.08332 7.08659C4.08332 6.43366 4.1175 5.7687 4.18502 5.11102C4.19327 5.03049 4.1665 4.95023 4.11097 4.89012C4.05571 4.82999 3.97709 4.7959 3.89479 4.7959H0.610395C0.483355 4.7959 0.371137 4.87643 0.332691 4.995C0.111945 5.67365 0 6.37718 0 7.08659C0 7.796 0.111945 8.49953 0.332691 9.1782C0.371137 9.29677 0.483355 9.3773 0.610395 9.3773H3.89479C3.97709 9.37728 4.05571 9.34319 4.11097 9.28305Z" fill="#4985FF"/>
                        <path d="M4.33977 10.189C4.31612 10.0512 4.19449 9.9502 4.05208 9.9502H1.10809C1.00528 9.9502 0.909849 10.0036 0.857158 10.0903C0.80474 10.1773 0.802744 10.2849 0.852017 10.3736C1.72759 11.9487 3.23177 13.1486 4.9795 13.6653C5.00712 13.6737 5.03534 13.6776 5.06353 13.6776C5.1504 13.6776 5.23443 13.6393 5.29084 13.5708C5.36519 13.4796 5.37601 13.3535 5.31818 13.2518C4.89321 12.504 4.55483 11.4451 4.33977 10.189Z" fill="#4985FF"/>
                        <path d="M12.8925 9.9502H9.94851C9.8061 9.9502 9.68447 10.0511 9.66082 10.189C9.44576 11.4451 9.10738 12.504 8.68243 13.2518C8.6246 13.3535 8.63543 13.4797 8.70978 13.5708C8.76619 13.6393 8.85019 13.6776 8.93709 13.6776C8.96501 13.6776 8.9935 13.6737 9.02112 13.6653C10.7688 13.1486 12.273 11.9487 13.1486 10.3736C13.1979 10.2849 13.1959 10.1772 13.1435 10.0903C13.0907 10.0036 12.9953 9.9502 12.8925 9.9502Z" fill="#4985FF"/>
                        <path d="M5.01182 4.1199C5.06708 4.18535 5.14939 4.22309 5.23598 4.22309H8.76447C8.85107 4.22309 8.93338 4.18535 8.98864 4.1199C9.04417 4.05446 9.06698 3.96834 9.05131 3.88475C8.63202 1.655 7.8268 0.214355 7.00023 0.214355C6.17365 0.214355 5.36844 1.655 4.94917 3.88472C4.93351 3.96834 4.95628 4.05446 5.01182 4.1199Z" fill="#4985FF"/>
                        </g>
                        <defs>
                        <clipPath id="clip0">
                        <rect width="14" height="13.7442" fill="white" transform="translate(0 0.214355)"/>
                        </clipPath>
                        </defs>
                        </svg>
                        <span>{{ selectedLang }}</span>
                        <svg style="margin: 15px 15px auto 0;" width="10" height="10" viewBox="0 0 10 10" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <g clip-path="url(#clip0)">
                        <path d="M4.50495 7.64518L0.20524 3.34534C-0.0684147 3.07182 -0.0684147 2.62835 0.20524 2.35496C0.478651 2.08155 0.922098 2.08155 1.19549 2.35496L5.00007 6.15966L8.80452 2.35507C9.07805 2.08166 9.52145 2.08166 9.79486 2.35507C10.0684 2.62848 10.0684 3.07193 9.79486 3.34545L5.49508 7.64529C5.35831 7.782 5.17925 7.85027 5.00009 7.85027C4.82085 7.85027 4.64165 7.78187 4.50495 7.64518Z" fill="#4985FF"/>
                        </g>
                        <defs>
                        <clipPath id="clip0">
                        <rect width="9.99998" height="10" fill="white" transform="translate(10) rotate(90)"/>
                        </clipPath>
                        </defs>
                        </svg>
                    </div>
                    <div style="width: 195px" class="login-us flex-row" @click="$router.push({ name: userActive ? 'profile' : 'login' })">
                        <svg style="margin: 13px 0 auto 15px;" width="14" height="14" viewBox="0 0 14 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M11.9679 12.7804L11.4725 8.8934C11.3032 7.56066 10.1694 6.5752 8.82596 6.5752H5.1741C3.8307 6.5752 2.69658 7.56066 2.52751 8.8934L2.03188 12.7877C1.99776 13.0601 2.08154 13.4025 2.26279 13.6078C2.44435 13.8134 2.70541 13.9998 2.97957 13.9998H11.0202C11.2943 13.9998 11.5554 13.8098 11.7373 13.6041C11.9185 13.3979 12.0023 13.0531 11.9679 12.7804Z" fill="#4985FF"/>
                        <path d="M6.99939 5.68432C8.56907 5.68432 9.84155 4.41184 9.84155 2.84216C9.84155 1.27248 8.56907 0 6.99939 0C5.42971 0 4.15723 1.27248 4.15723 2.84216C4.15723 4.41184 5.42971 5.68432 6.99939 5.68432Z" fill="#4985FF"/>
                        </svg>
                        <span v-if="userActive">Личный кабинет</span>
                        <span v-else>Войти</span>
                    </div> 
                    <div v-on-clickaway="toggleDropdownSmall" v-if="showCountrySmall" class="lang-list">
                        <div class="lang-item" v-for="lg in lang" :key="lg.id" @click="changeLang(lg)">{{ lg.name }}</div>
                    </div>
                    <div class="contact-us flex-row" @click="modalDisplay = true; sideMenu = false">
                        <svg style="margin: 13px 0 auto 15px;" width="14" height="14" viewBox="0 0 14 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <g clip-path="url(#clip0)">
                        <path d="M7.50022 0.498047C3.91634 0.498047 1.00044 3.18945 1.00044 6.49783C1.00759 7.84784 1.49258 9.15168 2.36941 10.1782C2.1881 11.2786 1.40511 12.1845 0.342489 12.5231C0.0804382 12.6102 -0.0614121 12.8932 0.0256257 13.1552C0.0935627 13.3598 0.284952 13.4977 0.500482 13.4976C2.12655 13.555 3.7205 13.0353 5.00032 12.0306C5.79737 12.3402 6.64516 12.4986 7.50022 12.4976C11.0841 12.4976 14 9.8062 14 6.49783C14 3.18945 11.0841 0.498047 7.50022 0.498047Z" fill="#4985FF"/>
                        </g>
                        <defs>
                        <clipPath id="clip0">
                        <rect width="14" height="14" fill="white"/>
                        </clipPath>
                        </defs>
                        </svg>
                        <span>Связаться с нами</span>
                    </div>
                </div>
            </div>
            <div class="side-right">
                <div @click="sideMenu = false" class="side-exit">
                    <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M15.4587 3.15142L10.6108 7.99983L15.4587 12.848C16.1798 13.5694 16.1798 14.7379 15.4587 15.4593C15.0984 15.8196 14.626 15.9999 14.1538 15.9999C13.6809 15.9999 13.2085 15.8199 12.8485 15.4593L7.99952 10.6106L3.15094 15.4592C2.79068 15.8195 2.31826 15.9998 1.84571 15.9998C1.37329 15.9998 0.901187 15.8198 0.540613 15.4592C-0.180488 14.7382 -0.180488 13.5696 0.540613 12.848L5.38837 7.99978L0.540338 3.15142C-0.180764 2.43032 -0.180764 1.26151 0.540338 0.540412C1.2613 -0.180137 2.42942 -0.180137 3.15066 0.540412L7.99948 5.38882L12.8479 0.540412C13.5693 -0.180137 14.7376 -0.180137 15.4584 0.540412C16.1798 1.26151 16.1798 2.43032 15.4587 3.15142Z" fill="white"/>
                    </svg>
                </div>
            </div>
        </div>
        <div class="nav-bar flex-row">
            <div @click="$router.push({ name: 'home' })" class="logo">
                <img src="/images/logo.png"/>
            </div>
            <div class="slogan">Экономим ваше время!</div>
            <div class="abs-items flex-row">
                <div class="contact-us flex-row" @click="modalDisplay = true;">
                    <svg style="margin: 13px 0 auto 15px;" width="14" height="14" viewBox="0 0 14 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <g clip-path="url(#clip0)">
                    <path d="M7.50022 0.498047C3.91634 0.498047 1.00044 3.18945 1.00044 6.49783C1.00759 7.84784 1.49258 9.15168 2.36941 10.1782C2.1881 11.2786 1.40511 12.1845 0.342489 12.5231C0.0804382 12.6102 -0.0614121 12.8932 0.0256257 13.1552C0.0935627 13.3598 0.284952 13.4977 0.500482 13.4976C2.12655 13.555 3.7205 13.0353 5.00032 12.0306C5.79737 12.3402 6.64516 12.4986 7.50022 12.4976C11.0841 12.4976 14 9.8062 14 6.49783C14 3.18945 11.0841 0.498047 7.50022 0.498047Z" fill="#4985FF"/>
                    </g>
                    <defs>
                    <clipPath id="clip0">
                    <rect width="14" height="14" fill="white"/>
                    </clipPath>
                    </defs>
                    </svg>
                    <span>Связаться с нами</span>
                </div>
                <div @click="showUserMenu = true" class="login-us flex-row">
                    <svg style="margin: 13px 0 auto 8px;" width="14" height="14" viewBox="0 0 14 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M11.9679 12.7804L11.4725 8.8934C11.3032 7.56066 10.1694 6.5752 8.82596 6.5752H5.1741C3.8307 6.5752 2.69658 7.56066 2.52751 8.8934L2.03188 12.7877C1.99776 13.0601 2.08154 13.4025 2.26279 13.6078C2.44435 13.8134 2.70541 13.9998 2.97957 13.9998H11.0202C11.2943 13.9998 11.5554 13.8098 11.7373 13.6041C11.9185 13.3979 12.0023 13.0531 11.9679 12.7804Z" fill="#4985FF"/>
                    <path d="M6.99939 5.68432C8.56907 5.68432 9.84155 4.41184 9.84155 2.84216C9.84155 1.27248 8.56907 0 6.99939 0C5.42971 0 4.15723 1.27248 4.15723 2.84216C4.15723 4.41184 5.42971 5.68432 6.99939 5.68432Z" fill="#4985FF"/>
                    </svg>
                    <span v-if="userActive">{{ userName.substr(0,userName.indexOf(' ')) + ' ' + userName.substr(userName.indexOf(' ')+1)[0] + '.' }}</span>
                    <span v-else>Войти</span>
                </div>
                <div v-on-clickaway="toggleDropdown" v-show="showUserMenu" id="user-drop-menu" class="user-drop-menu flex-col">
                    <div @click="$router.push({ name: 'profile' })" class="flex-row">
                        <svg width="14" height="14" viewBox="0 0 14 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M13.8212 8.68225L12.5651 7.9879C12.6919 7.33306 12.6919 6.66129 12.5651 6.00646L13.8212 5.3121C13.9657 5.23307 14.0305 5.06936 13.9833 4.91694C13.6561 3.91211 13.0988 3.00324 12.3705 2.24679C12.2585 2.13107 12.0757 2.10284 11.9342 2.18187L10.6781 2.87623C10.1503 2.44155 9.54294 2.10566 8.88543 1.8855V0.499621C8.88543 0.341557 8.77044 0.203251 8.60827 0.169381C7.52618 -0.0620701 6.41755 -0.0507798 5.38853 0.169381C5.22636 0.203251 5.11137 0.341557 5.11137 0.499621V1.88833C4.45681 2.11131 3.84942 2.44719 3.31869 2.87905L2.06559 2.1847C1.92112 2.10566 1.74126 2.13107 1.62922 2.24961C0.900941 3.00324 0.343678 3.91211 0.0163971 4.91977C-0.0337271 5.07218 0.034088 5.23589 0.178563 5.31493L1.43462 6.00928C1.30783 6.66411 1.30783 7.33589 1.43462 7.99072L0.178563 8.68507C0.034088 8.76411 -0.0307786 8.92781 0.0163971 9.08023C0.343678 10.0851 0.900941 10.9939 1.62922 11.7504C1.74126 11.8661 1.92406 11.8943 2.06559 11.8153L3.32164 11.121C3.84942 11.5556 4.45681 11.8915 5.11432 12.1117V13.5004C5.11432 13.6584 5.22931 13.7967 5.39148 13.8306C6.47357 14.0621 7.5822 14.0508 8.61122 13.8306C8.77338 13.7967 8.88837 13.6584 8.88837 13.5004V12.1117C9.54294 11.8887 10.1503 11.5528 10.681 11.121L11.9371 11.8153C12.0816 11.8943 12.2614 11.8689 12.3735 11.7504C13.1018 10.9968 13.659 10.0879 13.9863 9.08023C14.0305 8.92499 13.9657 8.76128 13.8212 8.68225ZM6.9984 9.25523C5.69812 9.25523 4.63961 8.24193 4.63961 6.99718C4.63961 5.75242 5.69812 4.73912 6.9984 4.73912C8.29868 4.73912 9.35718 5.75242 9.35718 6.99718C9.35718 8.24193 8.29868 9.25523 6.9984 9.25523Z" fill="#4985FF"/>
                        </svg>
                        <div class="label">Профиль</div>
                    </div>
                    <div @click="logOut()" class="flex-row">
                        <svg width="14" height="14" viewBox="0 0 14 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M5 13H2.33333C1.97971 13 1.64057 12.8595 1.39052 12.6095C1.14048 12.3594 1 12.0203 1 11.6667V2.33333C1 1.97971 1.14048 1.64057 1.39052 1.39052C1.64057 1.14048 1.97971 1 2.33333 1H5" stroke="#4985FF" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"/>
                            <path d="M9.66602 10.3332L12.9993 6.99984L9.66602 3.6665" stroke="#4985FF" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"/>
                            <path d="M13 7H5" stroke="#4985FF" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"/>
                        </svg>
                        <div class="label">Выйти</div>
                    </div>
                </div>
                <div id="lang-us" class="lang-us flex-row" @click="showCountry = showCountry ? false : true">
                    <svg style="margin: 12px 0 auto 15px;" width="14" height="14" viewBox="0 0 14 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <g clip-path="url(#clip0)">
                    <path d="M8.98866 10.0529C8.9334 9.98745 8.8511 9.94971 8.7645 9.94971H5.23601C5.14941 9.94971 5.0671 9.98745 5.01184 10.0529C4.95631 10.1183 4.9335 10.2045 4.94917 10.2881C5.36846 12.5178 6.17368 13.9585 7.00025 13.9585C7.82683 13.9585 8.63205 12.5178 9.05131 10.2881C9.06698 10.2045 9.0442 10.1183 8.98866 10.0529Z" fill="#4985FF"/>
                    <path d="M13.6672 4.995C13.6288 4.87643 13.5166 4.7959 13.3895 4.7959H10.1052C10.0229 4.7959 9.94426 4.83002 9.88899 4.89012C9.83346 4.95025 9.80669 5.03049 9.81495 5.11102C9.88246 5.7687 9.91664 6.43366 9.91664 7.08658C9.91664 7.73951 9.88246 8.40447 9.81495 9.06215C9.80669 9.14268 9.83346 9.22294 9.88899 9.28305C9.94426 9.34318 10.0229 9.37727 10.1052 9.37727H13.3896C13.5166 9.37727 13.6288 9.29674 13.6673 9.17817C13.888 8.49955 13.9999 7.79602 13.9999 7.08661C13.9999 6.3772 13.888 5.67367 13.6672 4.995Z" fill="#4985FF"/>
                    <path d="M9.66082 3.98433C9.68447 4.12217 9.8061 4.22313 9.94851 4.22313H12.8925C12.9953 4.22313 13.0908 4.16971 13.1435 4.08303C13.1959 3.99606 13.1979 3.88841 13.1486 3.79977C12.273 2.22462 10.7688 1.02477 9.02109 0.508017C8.90857 0.473899 8.78467 0.511641 8.70978 0.602536C8.63543 0.693698 8.6246 0.819812 8.68243 0.921578C9.10738 1.66929 9.44576 2.72824 9.66082 3.98433Z" fill="#4985FF"/>
                    <path d="M8.93306 4.7959H5.06562C4.91665 4.7959 4.79161 4.90607 4.77566 5.05148C4.70304 5.71252 4.66602 6.39731 4.66602 7.08662C4.66602 7.77592 4.70304 8.46071 4.77566 9.12175C4.79161 9.26716 4.91665 9.37733 5.06562 9.37733H8.93306C9.08203 9.37733 9.20707 9.26716 9.22301 9.12175C9.29564 8.46071 9.33266 7.77592 9.33266 7.08662C9.33266 6.39731 9.29564 5.71252 9.22301 5.05148C9.20707 4.90607 9.08203 4.7959 8.93306 4.7959Z" fill="#4985FF"/>
                    <path d="M1.10809 4.22321H4.05211C4.19452 4.22321 4.31614 4.12227 4.3398 3.9844C4.55485 2.72831 4.89323 1.66937 5.31818 0.92165C5.37601 0.819857 5.36519 0.693744 5.29084 0.602608C5.21622 0.512009 5.09287 0.473703 4.97953 0.50809C3.2318 1.02487 1.72759 2.22472 0.852017 3.79987C0.802744 3.88851 0.80474 3.99619 0.857158 4.08313C0.909849 4.16981 1.00525 4.22321 1.10809 4.22321Z" fill="#4985FF"/>
                    <path d="M4.11097 9.28305C4.1665 9.22292 4.19327 9.14269 4.18502 9.06215C4.1175 8.40447 4.08332 7.73952 4.08332 7.08659C4.08332 6.43366 4.1175 5.7687 4.18502 5.11102C4.19327 5.03049 4.1665 4.95023 4.11097 4.89012C4.05571 4.82999 3.97709 4.7959 3.89479 4.7959H0.610395C0.483355 4.7959 0.371137 4.87643 0.332691 4.995C0.111945 5.67365 0 6.37718 0 7.08659C0 7.796 0.111945 8.49953 0.332691 9.1782C0.371137 9.29677 0.483355 9.3773 0.610395 9.3773H3.89479C3.97709 9.37728 4.05571 9.34319 4.11097 9.28305Z" fill="#4985FF"/>
                    <path d="M4.33977 10.189C4.31612 10.0512 4.19449 9.9502 4.05208 9.9502H1.10809C1.00528 9.9502 0.909849 10.0036 0.857158 10.0903C0.80474 10.1773 0.802744 10.2849 0.852017 10.3736C1.72759 11.9487 3.23177 13.1486 4.9795 13.6653C5.00712 13.6737 5.03534 13.6776 5.06353 13.6776C5.1504 13.6776 5.23443 13.6393 5.29084 13.5708C5.36519 13.4796 5.37601 13.3535 5.31818 13.2518C4.89321 12.504 4.55483 11.4451 4.33977 10.189Z" fill="#4985FF"/>
                    <path d="M12.8925 9.9502H9.94851C9.8061 9.9502 9.68447 10.0511 9.66082 10.189C9.44576 11.4451 9.10738 12.504 8.68243 13.2518C8.6246 13.3535 8.63543 13.4797 8.70978 13.5708C8.76619 13.6393 8.85019 13.6776 8.93709 13.6776C8.96501 13.6776 8.9935 13.6737 9.02112 13.6653C10.7688 13.1486 12.273 11.9487 13.1486 10.3736C13.1979 10.2849 13.1959 10.1772 13.1435 10.0903C13.0907 10.0036 12.9953 9.9502 12.8925 9.9502Z" fill="#4985FF"/>
                    <path d="M5.01182 4.1199C5.06708 4.18535 5.14939 4.22309 5.23598 4.22309H8.76447C8.85107 4.22309 8.93338 4.18535 8.98864 4.1199C9.04417 4.05446 9.06698 3.96834 9.05131 3.88475C8.63202 1.655 7.8268 0.214355 7.00023 0.214355C6.17365 0.214355 5.36844 1.655 4.94917 3.88472C4.93351 3.96834 4.95628 4.05446 5.01182 4.1199Z" fill="#4985FF"/>
                    </g>
                    <defs>
                    <clipPath id="clip0">
                    <rect width="14" height="13.7442" fill="white" transform="translate(0 0.214355)"/>
                    </clipPath>
                    </defs>
                    </svg>
                    <span>{{ selectedLang }}</span>
                    <svg style="margin: 15px 15px auto 0;" width="10" height="10" viewBox="0 0 10 10" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <g clip-path="url(#clip0)">
                    <path d="M4.50495 7.64518L0.20524 3.34534C-0.0684147 3.07182 -0.0684147 2.62835 0.20524 2.35496C0.478651 2.08155 0.922098 2.08155 1.19549 2.35496L5.00007 6.15966L8.80452 2.35507C9.07805 2.08166 9.52145 2.08166 9.79486 2.35507C10.0684 2.62848 10.0684 3.07193 9.79486 3.34545L5.49508 7.64529C5.35831 7.782 5.17925 7.85027 5.00009 7.85027C4.82085 7.85027 4.64165 7.78187 4.50495 7.64518Z" fill="#4985FF"/>
                    </g>
                    <defs>
                    <clipPath id="clip0">
                    <rect width="9.99998" height="10" fill="white" transform="translate(10) rotate(90)"/>
                    </clipPath>
                    </defs>
                    </svg>
                </div>
            </div>
            <div v-on-clickaway="toggleDropdown" v-show="showCountry" id="lang-list" class="lang-list">
                <div class="lang-item" v-for="lg in lang" :key="lg.id" @click="changeLang(lg)">{{ lg.name }}</div>
            </div>
            <div @click="sideMenu = true" class="menu-btn">
                <svg style="margin-top: -12px;" width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M1.6 3.2H14.4C15.2832 3.2 16 2.484 16 1.6C16 0.716 15.284 0 14.4 0H1.6C0.716 0 0 0.716 0 1.6C0 2.484 0.716 3.2 1.6 3.2ZM14.4 6.4H1.6C0.716 6.4 0 7.116 0 8C0 8.88397 0.716 9.6 1.6 9.6H14.4C15.2832 9.6 16 8.88397 16 8C16 7.116 15.284 6.4 14.4 6.4ZM14.4 12.8H1.6C0.716 12.8 0 13.516 0 14.4C0 15.284 0.716 16 1.6 16H14.4C15.2832 16 16 15.284 16 14.4C16 13.516 15.284 12.8 14.4 12.8Z" fill="#4985FF"/>
                </svg>
            </div>
        </div>
        <div class="layout flex-row">
            <div class="layout-left">
                <div class="layout-text">
                    <div class="header">{{ $t('home.online-application')}}</div>
                    <div class="header">{{ $t('home.title')}}</div>
                    <div class="sub">{{ $t('home.content')}}</div>
                    <div class="join flex-row">
                        <span>{{ $t('home.enter')}}</span>
                        <img src="/images/btn-shuttle.png" alt="">
                    </div>
                    <div class="login flex-row">
                        <span>{{ $t('home.have-account')}}?</span>
                        <div @click="$router.push({ name: 'login' })" class="go-login">{{ $t('home.enter-system')}}</div>
                    </div>
                </div>
            </div>
            <div class="layout-right">
                <img class="layout-img" src="/images/Main-img.png" alt="laptop">
                <!-- <img class="layout-img-in" src="/images/layout-train.svg" alt="laptop"> -->
            </div>
        </div>
        <!-- <div class="service">
            <div class="service-header">Наши услуги</div>
            <div class="service-sub">Пользуясь услугами DARIS, у Вас появляется возможность получить широкий спектр услуг
                с любой точки нашей планеты, тем самым Вы экономите свое драгоценное время.</div>
            <div class="service-list flex-row">
                <div class="service-single flex-col">
                    <div class="circle"></div>
                    <span class="service-icon">
                        <svg width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M24.7715 29.7428L19.6435 24.6157L17.1578 27.1013C16.9432 27.3159 16.6317 27.4043 16.3347 27.3357C16.0377 27.2653 15.7991 27.0473 15.703 26.758L10.7308 11.8424C10.6253 11.5265 10.7076 11.178 10.9428 10.9428C11.1771 10.7085 11.5265 10.6227 11.8424 10.7308L26.758 15.703C27.0473 15.7991 27.2653 16.0377 27.3357 16.3347C27.4052 16.6308 27.3168 16.9424 27.1013 17.1578L24.6157 19.6435L29.7428 24.7714C30.0861 25.1147 30.0861 25.671 29.7428 26.0143L26.0143 29.7428C25.671 30.0862 25.1148 30.0862 24.7715 29.7428Z" fill="#4985FF"/>
                        <path d="M11.4258 7.03125C10.94 7.03125 10.5469 6.63814 10.5469 6.15234V0.878906C10.5469 0.393105 10.94 0 11.4258 0C11.9116 0 12.3047 0.393105 12.3047 0.878906V6.15234C12.3047 6.63814 11.9116 7.03125 11.4258 7.03125Z" fill="#4985FF"/>
                        <path d="M7.07572 8.31855L3.34634 4.58918C3.00304 4.24587 3.00304 3.68964 3.34634 3.34634C3.68964 3.00304 4.24587 3.00304 4.58918 3.34634L8.31849 7.07566C8.66179 7.41896 8.66179 7.97519 8.31849 8.31849C7.97519 8.66185 7.41902 8.66185 7.07572 8.31855Z" fill="#4985FF"/>
                        <path d="M3.34634 19.505C3.00304 19.1617 3.00304 18.6055 3.34634 18.2622L7.07566 14.5329C7.41896 14.1896 7.97519 14.1896 8.31849 14.5329C8.66179 14.8762 8.66179 15.4324 8.31849 15.7757L4.58918 19.505C4.24587 19.8483 3.6897 19.8483 3.34634 19.505Z" fill="#4985FF"/>
                        <path d="M14.5329 8.31849C14.1896 7.97519 14.1896 7.41896 14.5329 7.07566L18.2622 3.34634C18.6055 3.00304 19.1617 3.00304 19.505 3.34634C19.8483 3.68964 19.8483 4.24587 19.505 4.58917L15.7757 8.31849C15.4324 8.66179 14.8762 8.66179 14.5329 8.31849Z" fill="#4985FF"/>
                        <path d="M6.15234 12.3047H0.878906C0.393105 12.3047 0 11.9116 0 11.4258C0 10.94 0.393105 10.5469 0.878906 10.5469H6.15234C6.63814 10.5469 7.03125 10.94 7.03125 11.4258C7.03125 11.9116 6.63814 12.3047 6.15234 12.3047Z" fill="#4985FF"/>
                        </svg>
                    </span>
                    <div class="head">Онлайн Договора в пару кликов</div>
                </div>
                <div class="service-single flex-col">
                    <div class="circle"></div>
                    <span class="service-icon">
                        <svg width="30" height="22" viewBox="0 0 30 22" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M15.4604 8.39844H12.5928V9.9631H15.4604V8.39844Z" fill="#4985FF"/>
                        <path d="M7.55907 8.39844H4.69141V9.9631H7.55907V8.39844Z" fill="#4985FF"/>
                        <path d="M22.2839 11.7204C20.6149 11.7204 19.2571 10.3625 19.2571 8.69352V3.71804H17.7819C17.7591 3.61978 17.7199 3.52363 17.6613 3.43434L16.7674 2.07316H16.8284C17.3138 2.07316 17.7073 1.67966 17.7073 1.19429C17.7073 0.708926 17.3138 0.31543 16.8284 0.31543H12.5667C12.0814 0.31543 11.6879 0.708926 11.6879 1.19429C11.6879 1.67966 12.0814 2.07316 12.5667 2.07316H14.7133C14.7372 2.15753 14.7739 2.23973 14.8246 2.31689L15.7448 3.71804H2.82156C1.26574 3.71804 0 4.98378 0 6.5396V12.9784H24.7365C25.2219 12.9784 25.6154 13.3719 25.6154 13.8572C25.6154 14.3426 25.2219 14.7361 24.7365 14.7361H0V15.7316C0 17.2387 1.18764 18.4736 2.67614 18.5495L3.78937 19.9274H0.878863C0.393496 19.9274 0 20.3209 0 20.8063C0 21.2917 0.393496 21.6852 0.878863 21.6852H29.1154C29.6008 21.6852 29.9943 21.2917 29.9943 20.8063C29.9943 20.3209 29.6008 19.9274 29.1154 19.9274H24.5883L23.4781 18.5532H25.0914C26.6646 18.5532 28.1027 17.8273 29.037 16.5617C29.9713 15.2961 30.2415 13.708 29.7782 12.2046L29.629 11.7204H22.2839ZM9.3166 10.7798C9.3166 11.2984 8.89462 11.7204 8.37598 11.7204H3.87415C3.35544 11.7204 2.93347 11.2984 2.93347 10.7798V7.58087C2.93347 7.06217 3.35544 6.6402 3.87415 6.6402H8.37598C8.89468 6.6402 9.3166 7.06217 9.3166 7.58087V10.7798ZM17.2185 10.7798C17.2185 11.2984 16.7965 11.7204 16.2778 11.7204H11.7759C11.2572 11.7204 10.8353 11.2984 10.8353 10.7798V7.58087C10.8353 7.06217 11.2572 6.6402 11.7759 6.6402H16.2778C16.7965 6.6402 17.2185 7.06217 17.2185 7.58087V10.7798ZM15.3187 19.9274L14.2085 18.5532H16.5836L17.6938 19.9274H15.3187ZM10.6839 19.9274L9.57363 18.5532H11.9488L13.059 19.9274H10.6839ZM7.31396 18.5532L8.4242 19.9274H6.0491L4.93886 18.5532H7.31396ZM19.9535 19.9274L18.8433 18.5532H21.2185L22.3287 19.9274H19.9535ZM28.3375 14.7361H27.81C27.3246 14.7361 26.9311 14.3426 26.9311 13.8572C26.9311 13.3718 27.3246 12.9783 27.81 12.9783H28.3375C28.8229 12.9783 29.2164 13.3718 29.2164 13.8572C29.2164 14.3426 28.8229 14.7361 28.3375 14.7361Z" fill="#4985FF"/>
                        <path d="M21.0146 8.69319C21.0146 9.393 21.584 9.96233 22.2838 9.96233H29.0872L28.2291 7.17774C27.9181 6.16851 27.3047 5.30365 26.4551 4.67644C25.6055 4.04928 24.5983 3.71777 23.5423 3.71777H21.0146V8.69319Z" fill="#4985FF"/>
                        </svg>
                    </span>
                    <div class="head">Формирование акт выполненных работ <span>(счетов-фактур, актов сверки)</span>
                        за оказанные услуги по предоставлению подъездного пути.</div>
                </div>
            </div>
        </div> -->
        <div class="description flex-col">
            <!-- <div class="description-one flex-row">
                <div class="desc-left">
                    <div class="head">Описние возможностей</div>
                    <div class="desc-list flex-col">
                        <div class="desc-item flex-row">
                            <span class="circle">
                                <img src="/images/desc_1.png" alt="">
                            </span>
                            <div>Теперь нет необходимости тратить свое время
                            на бумажную работу.</div>
                        </div>
                        <div class="desc-item flex-row">
                            <span class="circle">
                                <img src="/images/desc_2.png" alt="">
                            </span>
                            <div>Благодаря нашей компании Вы можете: <br />
                            <span>заключить Договор, запросить акт-сверки, просмотреть (запросить) реестр количество пройденных вагонов в онлайн режиме не выходя из дома или офиса.</span></div>
                        </div>
                        <div class="desc-item flex-row">
                            <span class="circle">
                                <img src="/images/desc_3.png" alt="">
                            </span>
                            <div>Пользуясь услугами Компании Дарис, Вы получаете:<br /><span>качественный и своевременный спектр услуг
                            в онлайн режиме.</span></div>
                        </div>
                    </div>
                </div>
                <div class="desc-right">
                    <img src="/images/description-one.svg" alt="">
                </div>
            </div> -->
            <div class="description-two">
                <div class="dt-top flex-row">
                    <div class="dt-header">Возможности DARIS</div>
                    <!-- <div class="dt-sub">Lorem Ipsum - это текст-"рыба", часто используемый в
                    Lorem Ipsum - это текст-"рыба", </div> -->
                </div>
                <div class="dt-list flex-row">
                    <div class="dt-item">Заключение договоров</div>
                    <div class="dt-item">Счета на предоплату</div>
                    <div class="dt-item">Соглашения <span>(подачи / уборки вагонов)</span></div>
                    <div class="dt-item">Онлайн оплата</div>
                    <div class="dt-item">История платежей <span>(дебит / кредит)</span></div>
                    <div class="dt-item">История взаиморасчетов<br><span>
                    (акт выполенных работ, акт сверки)</span></div>
                </div>
            </div>
        </div>
        <div class="module">
            <div class="module-header">Модули в личном кабинете</div>
            <!-- <div class="module-sub">Lorem Ipsum - это текст-"рыба", часто используемый в</div>
            <div class="module-sub">Lorem Ipsum - это текст-"рыба",</div> -->
            <div class="module-list flex-row">
                <div class="module-single flex-col">
                    <img src="/images/image40.png" alt="">
                    <div class="head">Панель управления</div>
                </div>
                <div class="module-single flex-col">
                    <img src="/images/image41.png" alt="">
                    <div class="head">Акты выполненных работ</div>
                </div>
                <div class="module-single flex-col">
                    <img src="/images/image42.png" alt="">
                    <div class="head">Акт сверки</div>
                </div>
                <div class="module-single flex-col">
                    <img src="/images/image43.png" alt="">
                    <div class="head">Договоры</div>
                </div>
                <div class="module-single flex-col">
                    <img src="/images/image44.png" alt="">
                    <div class="head">Счета на предоплату</div>
                </div>
                <div class="module-single flex-col">
                    <img src="/images/image45.png" alt="">
                    <div class="head">Соглашения</div>
                </div>
                <!-- <div class="more-module flex-row">
                    <span>Показать еще</span>
                    <svg style="position: absolute; right: 30px;top: 14px;" width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <g clip-path="url(#clip0)">
                    <path d="M15.2904 10.9901L6.69068 19.5895C6.14364 20.1368 5.2567 20.1368 4.70992 19.5895C4.1631 19.0427 4.1631 18.1558 4.70992 17.609L12.3193 9.99986L4.71014 2.39095C4.16332 1.84391 4.16332 0.957105 4.71014 0.410283C5.25696 -0.136761 6.14386 -0.136761 6.6909 0.410283L15.2906 9.00983C15.564 9.28337 15.7005 9.64151 15.7005 9.99981C15.7005 10.3583 15.5637 10.7167 15.2904 10.9901Z" fill="white"/>
                    </g>
                    <defs>
                    <clipPath id="clip0">
                    <rect width="20" height="20" fill="white"/>
                    </clipPath>
                    </defs>
                    </svg>
                </div> -->
            </div>
        </div>
        <div class="home-last">
            <div class="hl-header">Пользуясь услугами ERC DARIS, Вы получаете качественный и своевременный сервис в онлайн режиме.</div>
        </div>
        <div class="footer">
            <div class="footer-body flex-row">
                <div @click="$router.push({ name: 'home' })" class="logo">
                    <img src="/images/logo.png"/>
                </div>
                <div class="fm-foot">© ООО «Правообладатель<br> контента», 2010—2015</div>
                <div class="f-right flex-col">
                    <div class="fr-head">Мы с радостью готовы Вам помочь!</div>
                    <div class="contacts flex-row">
                        <div class="contact flex-col">
                            <div class="label">Горячая линия:</div>
                            <a class="value">+7 (727) 250-30-20</a>
                        </div>
                        <div class="contact flex-col">
                            <div class="label">Режим работы:</div>
                            <a class="value">Ежедневно с 10:00 до 19:00</a>
                        </div>
                        <div class="contact flex-col">
                            <div class="label">E-mail почта:</div>
                            <a class="value">Daris_info@gmail.com</a>
                        </div>
                    </div>
                </div>
            </div>
        </div>
    </div>
</template>
<script>
import { mixin as clickaway } from 'vue-clickaway';

    export default {
        mixins: [ clickaway ],
        data(){
            return {
                showCountry: false,
                showCountrySmall: false,
                modalDisplay: false,
                sideMenu: false,
                showUserMenu: false,
                selectedLang: 'RU',
                lang: [
                    {
                        id: 1,
                        name: 'Казахский',
                        attr: 'KZ'
                    },
                    {
                        id: 2,
                        name: 'Русский',
                        attr: 'RU'
                    },
                    {
                        id: 3,
                        name: 'English',
                        attr: 'EN'
                    }
                ],
                userActive: false,
                userName: ''
            }
        },
        mounted() {
            if( JSON.parse(localStorage.getItem('xyzSessionAoUser')) ){
                this.userActive = true
                this.userName = JSON.parse(localStorage.getItem('xyzSessionAoUser')).manager_name
            }
        },
        methods: {
            logOut(){
                localStorage.removeItem('xyzSessionAo');
                localStorage.removeItem('xyzSessionAoUser');
                this.$router.push({ name: 'home' })
            },
            toggleDropdown(e) {
                let langUs = document.getElementById("lang-us")
                if(!langUs.contains(e.target)){
                    this.showCountry = false
                }
                let userMenu = document.getElementById("user-drop-menu")
                if(!userMenu.contains(e.target)){
                    this.showUserMenu = false
                }
            },
            toggleDropdownSmall(e) {
                let langUsSm = document.getElementById("lang-us-sm")
                if(!langUsSm.contains(e.target)){
                    this.showCountrySmall = false
                }
            },
            changeLang(val){
                this.selectedLang = val.attr
                this.showCountry = false
            }
        }
    }
</script>
<style lang="scss" scoped>
    .contact-modal{
        z-index: 998;
        width: 100%;
        position: fixed;
        height: 100%;
        padding: 150px 20%;
        background: rgba(45, 76, 100, 0.7);
        .modal-body{
            position: relative;
            padding: 0;
            border-radius: 12px !important;
            height: 500px;
            background: #FFFFFF;
            .modal-left{
                position: relative;
                width: 54%;
                padding: 50px;
                .ml-head{
                    text-align: left;
                    font-style: normal;
                    font-weight: bold;
                    font-size: 32px;
                    line-height: 146.28%;
                    color: #2D4C64;
                }
                .ml-sub{
                    text-align: left;
                    margin-top: 20px;
                    font-style: normal;
                    font-weight: bold;
                    font-size: 20px;
                    line-height: 150%;
                    color: #2D4C64;
                }
                .ml-contacts{
                    margin-top: 10px;
                    flex-wrap: wrap;
                    .contact{
                        margin-top: 15px;
                        margin-right: 40px;
                        .label{
                            text-align: left;
                            font-style: normal;
                            font-weight: 600;
                            font-size: 18px;
                            line-height: 22px;
                            color: #4985FF;
                        }
                        .value{
                            margin-top: 5px;
                            text-align: left;
                            font-style: normal;
                            font-weight: normal;
                            font-size: 16px;
                            line-height: 25px;
                            color: #999999;
                        }
                    }
                }
                .ml-back{
                    position: absolute;
                    cursor: pointer;
                    bottom: 50px;
                    width: calc(100% - 100px);
                    height: 50px;
                    border-radius: 6px;
                    padding-top: 14px;
                    background: #4985FF;
                    box-shadow: 0px 0px 10px rgba(111, 111, 111, 0.25);
                    border-radius: 6px;
                    text-align: center;
                    color: #FFFFFF;
                    font-weight: bold;
                    font-size: 16px;
                    line-height: 20px;
                }
            }
            .modal-right{
                width: 46%;
                height: 100%;
                overflow: hidden;
                border-bottom-right-radius: 12px;
                border-top-right-radius: 12px;
                img{
                    object-fit: contain;
                    object-position: center;
                }
            }
            .modal-exit{
                z-index: 999;
                cursor: pointer;
                position: absolute;
                top: 25px;
                right: 25px;
            }
        }
    }
    .nav-bar{
        position: relative;
        width: 100%;
        height: 100px;
        background: #FFFFFF;
        font-size: 16px;
        line-height: 50px;
        color: #06397D;
        font-weight: 500;
        .logo{
            cursor: pointer;
            margin-left: 8%;
            margin-top: 6px;
            // background: #F6F6F8;
            img{
                width: 100%;
            }
        }
        .slogan{
            margin-left: 30px;
            height: 50px;
            margin-top: 25px;
            width: auto;
        }
        .abs-items{
            position: absolute;
            top: 30px;
            right: 8%;
            .user-drop-menu{
                position: absolute;
                right: 120px;
                top: 40px;
                z-index: 98;
                background: #FFFFFF;
                box-shadow: 0px 0px 10px rgba(73, 133, 255, 0.15);
                border-radius: 6px;
                padding: 6px 18px;
                .flex-row{
                    padding: 9px 0;
                    cursor: pointer;
                    .label{
                        margin-left: 9px;
                        font-size: 14px;
                        line-height: 16px;
                        text-align: left;
                        color: #4985FF;
                    }
                    svg, .label{
                        cursor: pointer;
                    }
                }
                .flex-row:last-of-type{
                    border-top: 0.5px solid #DFE0EB;
                }
            }
        }
        .contact-us{
            cursor: pointer;
            color: #4985FF;
            border: 1px solid #4985FF;
            box-sizing: border-box;
            height: 40px;
            border-radius: 6px;
            span{
                cursor: pointer;
                margin: -5px 12px 5px 8px;
            }
        }
        .login-us{
            z-index: 99;
            cursor: pointer;
            margin-left: 10px;
            width: auto;
            color: #4985FF;
            border: 1px solid #4985FF;
            box-sizing: border-box;
            height: 40px;
            border-radius: 6px;
            span{
                cursor: pointer;
                margin: -5px 12px 5px 6px;
            }
        }
        .lang-us{
            cursor: pointer;
            margin-left: 10px;
            width: auto;
            color: #4985FF;
            border: 1px solid #4985FF;
            box-sizing: border-box;
            height: 40px;
            border-radius: 6px;
            span{
                cursor: pointer;
                margin: -5px 12px 5px 6px;
            }
        }
        .lang-list{
            transition: all 1s ease 0s;
            z-index: 999;
            position: absolute;
            cursor: pointer;
            width: auto;
            top: 76px;
            right: calc(8%);
            border: 1px solid #4985FF;
            background: #FFFFFF;
            box-sizing: border-box;
            border-radius: 6px;
            overflow: hidden;
            .lang-item{
                text-align: left;
                cursor: pointer;
                height: 34px;
                font-style: normal;
                font-weight: 500;
                font-size: 12px;
                line-height: 13px;
                color: #4985FF;
                padding: 10px 15px;
            }
            .lang-item:hover{
                background: #4985FF;
                color: #FFFFFF;
            }
        }
        .menu-btn{
            display: none;
            position: absolute;
            top: 30px;
            right: 8%;
            cursor: pointer;
            width: 48px;
            height: 42px;
            top: 30px;
            right: calc(10%);
            border: 1px solid #4985FF;
            box-sizing: border-box;
            border-radius: 6px;
        }
    }
    .side-menu{
        display: none;
    }
    .main{
        position: relative;
        width: 100%;
        .layout{
            background: #FFFFFF;
            position: relative;
            height: 720px;
            background-image: linear-gradient( rgba(196, 196, 196, 0.4), rgba(196, 196, 196, 0.4) ), url('/images/layout.png');
            background-repeat: no-repeat;
            background-position: center;
            background-size: cover;
            .layout-left{
                position: relative;
                width: 56%;
                .layout-text{
                    width: 460px;
                    position: relative;
                    top: 160px;
                    left: 32%;
                    color: #06397D;
                    .header{
                        text-align: left;
                        font-weight: 800;
                        font-size: 42px;
                        line-height: 56px;
                    }
                    .sub{
                        margin-top: 30px;
                        text-align: left;
                        height: 77px;
                        font-weight: normal;
                        font-size: 16px;
                        line-height: 25px;
                    }
                    .join{
                        cursor: pointer;
                        display: table;
                        width: auto;
                        margin-top: 54px;
                        box-sizing: border-box;
                        border-radius: 6px;
                        background: #4985FF;
                        box-shadow: 0px 0px 10px rgba(111, 111, 111, 0.25);
                        border-radius: 6px;
                        padding: 14px 20px 14px 30px;
                        span{
                            color: #FFFFFF;
                            cursor: pointer;
                            // margin: 14px 20px auto 30px;
                            font-weight: bold;
                            font-size: 16px;
                            line-height: 20px;
                        }
                        img{
                            margin-top: 0px;
                            margin-left: 20px;
                            width: 20px;
                            height: 20px;
                        }
                    }
                    .login{
                        text-align: left;
                        margin-top: 30px;
                        font-weight: 500;
                        font-size: 14px;
                        line-height: 17px;
                        .go-login{
                            cursor: pointer;
                            margin-left: 10px;
                            font-weight: 600;
                            text-decoration-line: underline;
                            color: #4985FF;
                        }
                    }
                }
            }
            .layout-right{
                background: #FFFFFF;
                .layout-img{
                    width: 560px;
                    position: absolute;
                    right: 10%;
                    top: 184px;
                }
                .layout-img-in{
                    width: 555px;
                    position: absolute;
                    left: 44%;
                    top: 138px;
                }
            }
        }
    }
    .service{
        position: relative;
        height: 700px;
        background: #D6E6FF;
        padding: 0 18%;
        .service-header{
            text-align: left;
            margin-top: 80px;
            font-weight: bold;
            font-size: 36px;
            line-height: 53px;
            color: #06397D;
            margin-bottom: 15px;
        }
        .service-sub{
            font-size: 16px;
            line-height: 25px;
            text-align: left;
            color: #06397D;
        }
        .service-list{
            position: relative;
            margin-top: 45px;
            .service-single{
                position: relative;
                background: #FCFCFC;
                border: 1px solid #E6EAF3;
                box-sizing: border-box;
                border-radius: 10px;
                padding: 0 30px;
                height: 240px;
                width: calc(50% - 15px);
                div{
                    text-align: left;
                }
                .circle{
                    margin-top: 8px;
                    width: 50px;
                    height: 50px;
                    background: #4985FF;
                    opacity: 0.1;
                    border-radius: 50%;
                }
                .service-icon{
                    position: absolute;
                    top: 45px;
                    left: 45px;
                }
                .head{
                    margin-top: 25px;
                    font-weight: 600;
                    font-size: 18px;
                    line-height: 170%;
                    color: #06397D;
                    span{
                        font-weight: normal;
                    }
                }
            }
            .service-single:last-of-type{
                margin-left: 30px;
                .circle{
                    margin-top: 26px;
                }
                .service-icon{
                    top: 38px;
                    left: 40px;
                }
                .head{
                    margin-top: 12px;
                }
            }
        }
    }
    .description{
        position: relative;
        background: #FFFFFF;
        .description-one{
            position: relative;
            .desc-left{
                padding: 70px 20px 70px 18%;
                width: 54%;
                color: #06397D;
                div{
                    text-align: left;
                }
                .head{
                    font-weight: bold;
                    font-size: 32px;
                    line-height: 42px;
                }
                .desc-list{
                    margin-top: 10px;
                    .desc-item{
                        margin-top: 30px;
                        .circle{
                            width: 50px;
                            height: 50px;
                            background: rgba(73, 133, 255, 0.1);
                            border-radius: 50%;
                            padding: 10px;
                        }
                        div{
                            margin-left: 25px;
                            font-weight: 600;
                            font-size: 16px;
                            line-height: 150%;
                            color: #06397D;
                            span{
                                font-weight: normal;
                            }
                        }
                    }
                }
            }
            .desc-right{
                position: relative;
                margin-left: 6%;
                width: 46%;
                overflow: hidden;
                img{
                    display: block;
                    position: absolute;
                    top: 50%;
                    left: 50%;
                    min-height: 100%;
                    min-width: 100%;
                    transform: translate(-50%, -50%);
                }
            }
        }
        .description-two{
            position: relative;
            padding: 70px 18%;
            background: #D6E6FF;
            .dt-top{
                .dt-header{
                    text-align: left;
                    font-style: normal;
                    font-weight: bold;
                    font-size: 32px;
                    line-height: 42px;
                    color: #06397D;
                    width: 100%;
                }
                .dt-sub{
                    width: calc(66% - 24px);
                    margin-left: 24px;
                    font-style: normal;
                    font-weight: 500;
                    font-size: 16px;
                    line-height: 26px;
                    color: #06397D;
                    text-align: left;
                }
            }
            .dt-list{
                margin-top: 10px;
                flex-wrap: wrap;
                .dt-item{
                    padding: 0 4px;
                    margin-right: 24px;
                    margin-top: 24px;
                    width: calc(33% - 16px);
                    background: #FCFCFC;
                    border: 1px solid #E6EAF3;
                    border-radius: 10px;
                    height: 100px;
                    display: flex;
                    flex-direction: column;
                    justify-content: center;
                    align-items: center;
                    font-style: normal;
                    font-weight: 600;
                    font-size: 18px;
                    line-height: 24px;
                    align-items: center;
                    text-align: center;
                    color: #06397D;
                    span{
                        font-weight: normal;
                    }
                }
                .dt-item:nth-child(3n){
                    margin-right: 0;
                }
            }
        }
    }
    .module{
        position: relative;
        padding: 80px 18%;
        background: #FCFCFC;
        .module-header{
            font-style: normal;
            font-weight: bold;
            font-size: 32px;
            line-height: 53px;
            text-align: center;
            color: #06397D;
            margin-bottom: 15px;
        }
        .module-sub{
            font-size: 16px;
            line-height: 25px;
            text-align: center;
            color: #999999;
        }
        .module-list{
            flex-wrap: wrap;
            position: relative;
            margin-top: 50px;
            .module-single{
                background: #FFFFFF;
                padding: 20px;
                height: 380px;
                margin-right: 24px;
                margin-top: 24px;
                width: calc(33% - 16px);
                background: #FCFCFC;
                box-shadow: 0px 0px 15px #D8D8D8;
                border-radius: 10px;
                img{
                    height: 210px;
                    width: 100%;
                    background: rgba(233, 233, 233, 0.4);
                    object-fit: cover;
                    object-position: center;
                }
                .head{
                    height: 120px;
                    margin-top: 30px;
                    font-style: normal;
                    font-weight: 600;
                    font-size: 18px;
                    line-height: 150%;
                    display: flex;
                    text-align: center;
                    justify-content: center;
                    align-items: center;
                    color: #06397D;
                }
            }
            .module-single:nth-child(3n){
                margin-right: 0;
            }
        }
        .more-module{
            display: none;
            position: relative;
            cursor: pointer;
            width: 100%;
            margin-top: 42px;
            box-sizing: border-box;
            height: 50px;
            border-radius: 6px;
            background: #4985FF;
            box-shadow: 0px 0px 10px rgba(111, 111, 111, 0.25);
            border-radius: 6px;
            span{
                color: #FFFFFF;
                cursor: pointer;
                margin: 14px 10px auto 30px;
                font-weight: bold;
                font-size: 16px;
                line-height: 20px;
            }
        }
    }
    .home-last{
        position: relative;
        height: auto;
        background: #D6E6FF;
        overflow: hidden;
        padding: 80px 18% 80px 18%;
        .hl-header{
            font-weight: bold;
            font-size: 36px;
            line-height: 53px;
            color: #2D4C64;
            margin-bottom: 15px;
        }
    }
    .footer{
        position: relative;
        height: auto;
        padding-bottom: 30px;
        background: #FFFFFF;
        padding-top: 40px;
        .footer-body{
            position: relative;
            width: 64%;
            left: 18%;
            .logo{
                cursor: pointer;
                font-size: 16px;
                line-height: 50px;
                color: #06397D;
                font-weight: 500;
                img{
                    width: 120px;
                    transform: translateY(-35%);
                }
            }
            .fm-foot{
                top: 90px;
                padding-bottom: 20px;
                position: absolute;
                text-align: left;
                font-style: normal;
                font-weight: normal;
                font-size: 16px;
                line-height: 25px;
                color: #999999;
            }
            .f-right{
                position: absolute;
                right: 0;
                width: 520px;
                .fr-head{
                    text-align: left;
                    margin-top: 15px;
                    font-style: normal;
                    font-weight: bold;
                    font-size: 18px;
                    line-height: 22px;
                    color: #2D4C64;
                }
                .contacts{
                    margin-top: 10px;
                    flex-wrap: wrap;
                    .contact{
                        margin-top: 15px;
                        margin-right: 40px;
                        .label{
                            text-align: left;
                            font-style: normal;
                            font-weight: 600;
                            font-size: 18px;
                            line-height: 22px;
                            color: #4985FF;
                        }
                        .value{
                            margin-top: 5px;
                            text-align: left;
                            font-style: normal;
                            font-weight: normal;
                            font-size: 16px;
                            line-height: 25px;
                            color: #999999;
                        }
                    }
                }
            }
        }
    }
    @media only screen and (max-width: 1480px){
        .layout .layout-left .layout-text{
            max-width: 420px;
        }
    }
    @media only screen and (min-width: 1520px){
        .layout-right{
            .layout-img{
                min-width: 500px;
            }
            .layout-img-in{
                min-width: 585px;
                right: 150px;
            }
        }
    }
    @media only screen and (min-width: 1620px){
        .module-list{
            .module-single{
                padding: 30px !important;
                height: 380px;
            }
        }
        .layout-right{
            .layout-img{
                min-width: 660px;
            }
            .layout-img-in{
                min-width: 645px;
            }
        }
    }
    @media only screen and (min-width: 1740px){
        .layout-right{
            .layout-img{
                min-width: 680px;
            }
            .layout-img-in{
                min-width: 845px;
            }
        }
    }
    @media only screen and (max-width: 1720px){
        .footer{
            .footer-body{
                width: 80%;
                left: 10%;
                .f-mid{
                    width: 410px;
                }
                .fm-sub{
                    margin-top: 15px;
                }
                .fm-foot{
                    margin-top: 30px;
                }
            }
        }
    }
    @media only screen and (max-width: 1340px){
        .contact-modal{
            padding: 150px 12%;
            .modal-body{
                .modal-left{
                    padding: 40px;
                    .ml-back{
                        position: absolute;
                        cursor: pointer;
                        bottom: 40px;
                        width: calc(100% - 80px);
                    }
                }
            }
        }
        .layout{
            height: 560px !important;
            .layout-left{
                .layout-text{
                    top: 80px !important;
                    left: 18% !important;
                }
            }
            .layout-right{
                .layout-img{
                    right: 8% !important;
                    width: 440px !important;
                }
            }
        }
        .service{
            height: 660px;
            padding: 0 10%;
        }
        .description-one{
            .desc-left{
                padding: 50px 20px 60px 10% !important;
            }
        }
        .description-two{
            padding: 50px 10% !important;
        }
        .module{
            padding: 50px 10% !important;
        }
        .home-last{
            padding: 30px 10% 30px 10% !important;
        }
        .footer{
            padding-top: 50px;
            .footer-body{
                .f-right{
                    width: 460px;
                    .contacts{
                        margin-top: 0;
                    }
                }
            }
        }
    }
    @media only screen and (max-width: 1120px){
        .footer{
            .footer-body{
                width: 80%;
                left: 10%;
            }
        }
    }
    @media only screen and (max-width: 1020px){
        .contact-modal{
            padding: 120px 8%;
            .modal-body{
                .modal-left{
                    width: 60%;
                    padding: 25px;
                    .ml-back{
                        position: absolute;
                        cursor: pointer;
                        bottom: 25px;
                        width: calc(100% - 50px);
                    }
                }
                .modal-right{
                    width: 40%;
                }
            }
        }
        .side-menu{
            position: fixed;
            height: 100%;
            z-index: 10;
            width: 100%;
            .side-left{
                padding-left: 12.5%;
                padding-right: 12.5%;
                height: 100%;
                width: 80%;
                background: #FFFFFF;
                font-size: 16px;
                line-height: 50px;
                color: #06397D;
                font-weight: 500;
                .side-top{
                    display: flex;
                    flex-direction: row;
                    .logo{
                        cursor: pointer;
                        position: relative;
                        // left: 12.5%;
                        top: 25px;
                        img{
                            width: 120px;
                            transform: translateY(-35%);
                        }
                    }
                    .slogan{
                        margin-left: 30px;
                        position: absolute;
                        height: 50px;
                        top: 25px;
                        left: calc(30%);
                        width: auto;
                    }
                }
                .side-slogan{
                    display: none;
                }
                .side-head{
                    margin-top: 95px;
                    text-align: left;
                    font-weight: 600;
                    font-size: 18px;
                    line-height: 22px;
                    color: #2D4C64;
                }
                .side-text{
                    text-align: left;
                    margin-top: 15px;
                    font-weight: normal;
                    font-size: 14px;
                    line-height: 158.47%;
                    color: #999999;
                }
                .side-btns{
                    flex-wrap: wrap;
                    position: relative;
                    margin-top: 25px;
                    .contact-us{
                        margin-top: 20px;
                        margin-right: 12px;
                        cursor: pointer;
                        width: auto;
                        color: #4985FF;
                        border: 1px solid #4985FF;
                        box-sizing: border-box;
                        height: 40px;
                        border-radius: 6px;
                        span{
                            cursor: pointer;
                            margin: -5px 12px 5px 8px;
                        }
                    }
                    .login-us{
                        margin-top: 20px;
                        margin-right: 12px;
                        cursor: pointer;
                        width: auto;
                        color: #4985FF;
                        border: 1px solid #4985FF;
                        box-sizing: border-box;
                        height: 40px;
                        border-radius: 6px;
                        span{
                            cursor: pointer;
                            margin: -5px 12px 5px 6px;
                        }
                    }
                    .lang-us{
                        margin-top: 20px;
                        margin-right: 12px;
                        z-index: 99;
                        cursor: pointer;
                        width: auto;
                        color: #4985FF;
                        border: 1px solid #4985FF;
                        box-sizing: border-box;
                        height: 40px;
                        border-radius: 6px;
                        span{
                            cursor: pointer;
                            margin: -5px 12px 5px 6px;
                        }
                    }
                    .lang-list{
                        position: absolute;
                        top: 64px;
                        transition: all 1s ease 0s;
                        z-index: 999 !important;
                        cursor: pointer;
                        width: 95px;
                        border: 1px solid #4985FF;
                        box-sizing: border-box;
                        border-radius: 6px;
                        overflow: hidden;
                        background: #FFFFFF;
                        .lang-item{
                            text-align: left;
                            cursor: pointer;
                            height: 34px;
                            font-style: normal;
                            font-weight: 500;
                            font-size: 11px;
                            line-height: 13px;
                            color: #4985FF;
                            padding: 10px 15px;
                        }
                        .lang-item:hover{
                            background: #4985FF;
                            color: #FFFFFF;
                        }
                    }
                }
            }
            .side-right{
                position: relative;
                width: 20%;
                height: 100%;
                background: #2D4C64;
                opacity: 0.7;
                .side-exit{
                    position: absolute;
                    width: 48px;
                    height: 42px;
                    top: 39px;
                    right: calc(50%);
                }
            }
        }
        .nav-bar{
            .menu-btn{
                display: block;
            }
            .contact-us, .login-us, .lang-us{
                display: none;
            }
        }
        .layout{
            height: 480px !important;
            .layout-left{
                width: 100% !important;
                .layout-text{
                    width: 60% !important;
                    top: 70px !important;
                    left: 20% !important;
                    .header{
                        font-weight: 700 !important;
                        font-size: 32px !important;
                        line-height: 52px !important;
                    }
                    .sub{
                        margin-top: 25px !important;
                        height: 70px !important;
                        font-size: 16spx !important;
                        line-height: 23px !important;
                    }
                    .join{
                        margin-top: 36px !important;
                        height: 50px !important;
                        span{
                            font-size: 14px !important;
                        }
                    }
                }
            }
            .layout-right{
                display: none !important;
            }
        }
        .service{
            .service-header{
                margin-top: 50px;
            }
            .service-list{
                flex-direction: column !important;
                margin-top: 25px !important;
                .service-single{
                    padding: 0 30px;
                    height: 180px;
                    width: calc(100%);
                    margin-left: 0 !important;
                    margin-top: 20px;
                }
            }
        }
        .description-one{
            flex-wrap: wrap;
            .desc-left{
                padding: 50px 10% !important;
                width: 100% !important;
            }
            .desc-right{
                margin-left: 0 !important;
                width: 100% !important;
                height: 280px !important;
            }
        }
        .description-two{
            .dt-top{
                flex-direction: column !important;
                .dt-header{
                    text-align: left;
                    font-size: 32px;
                    line-height: 42px;
                    width: 100% !important;
                }
                .dt-sub{
                    margin-top: 15px;
                    text-align: left;
                    width: 100% !important;
                    margin-left: 0 !important;
                    font-size: 16px;
                    line-height: 26px;
                }
            }
            .dt-list{
                margin-top: 10px;;
                .dt-item{
                    padding: 0 8px !important;
                    margin-right: 24px;
                    margin-top: 24px;
                    width: calc(50% - 12px) !important;
                }
            }
            .dt-item:nth-child(3n){
                margin-right: 24px !important;
            }
            .dt-item:nth-child(2n){
                margin-right: 0 !important;
            }
        }
        .module{
            .module-list{
                margin-top: 10px !important;
                .module-single{
                    padding: 15px !important;
                    height: 380px;
                    margin-right: 32px !important;
                    margin-top: 32px !important;
                    width: calc(50% - 16px) !important;
                }
                .module-single:nth-child(3n){
                    margin-right: 32px !important;
                }
                .module-single:nth-child(2n){
                    margin-right: 0px !important;
                }
            }
        }
    }
    @media only screen and (max-width: 920px){
        .service{
            height: 700px;
            .service-list{
                margin-top: 15px !important;
                .service-single{
                    padding: 0 20px;
                    height: 200px;
                    .service-icon{
                        left: 30px !important;
                    }
                }
            }
        }
        .footer{
            .footer-body{
                .fm-foot{
                    top: 180px;
                    padding-bottom: 20px;
                }
                .f-right{
                    margin-top: 60px;
                    width: 100%;
                }

            }
        }
    }
    @media only screen and (max-width: 836px){
        .footer{
            height: auto;
            padding-bottom: 10px;
            .footer-body{
                .fm-foot{
                    top: 220px;
                    padding-bottom: 20px;
                }
            }
        }
    }
    @media only screen and (max-width: 640px){
        .contact-modal{
            padding: 120px 8%;
            .modal-body{
                height: 550px;
                .modal-left{
                    margin-top: 190px;
                    width: 100%;
                    .ml-head{
                        font-size: 28px;
                        line-height: 38px;
                    }
                    .ml-sub{
                        margin-top: 16px;
                        font-size: 16px;
                        line-height: 130%;
                    }
                    .ml-contacts{
                        .contact{
                            margin-top: 10px;
                            margin-right: 20px;
                            .label{
                                font-size: 14px;
                                line-height: 18px;
                            }
                            .value{
                                font-size: 14px;
                                line-height: 18px;
                            }
                        }
                    }
                }
                .modal-right{
                    position: absolute;
                    top: 0;
                    height: 190px;
                    width: 100%;
                    border-top-left-radius: 12px;
                    border-top-right-radius: 12px;
                }
            }
        }
    }
    @media only screen and (max-width: 620px){
        .side-menu{
            .side-left{
                width: 76%;
                .side-top{
                    .slogan{
                        display: none;
                    }
                }
                .side-slogan{
                    text-align: left;
                    display: block;
                    font-size: 16px;
                    line-height: 50px;
                    color: #06397D;
                    font-weight: 500;
                    height: 50px;
                    margin-top: 35px;
                }
                .side-head{
                    margin-top: 30px;
                }
            }
            .side-right{
                width: 24%;
                .side-exit{
                    top: 39px;
                    right: calc(20%);
                }
            }
        }
        .menu-btn{
            right: calc(5%) !important;
        }
        .nav-bar .slogan{
            display: none;
        }
        .layout{
            height: 440px !important;
            .layout-left{
                .layout-text{
                    width: 80% !important;
                    top: 40px !important;
                    left: 10% !important;
                    .header{
                        font-size: 28px !important;
                        line-height: 42px !important;
                    }
                    .sub{
                        margin-top: 15px !important;
                        height: 110px !important;
                    }
                    .join{
                        margin-top: 32px !important;
                    }
                    .login{
                        margin-top: 10px !important;
                        flex-direction: column !important;
                        span, div{
                            text-align: left !important;
                            margin-left: 0 !important;
                            margin-top: 10px !important;
                        }
                    }
                }
            }
            .layout-right{
                display: none !important;
            }
        }
        .service{
            height: 800px;
            .service-header{
                margin-top: 40px;
                font-size: 28px;
            }
            .service-sub{
                font-size: 14px;
                line-height: 20px;
            }
            .service-list{
                margin-top: 15px !important;
                .service-single{
                    padding: 0 20px;
                    height: 240px;
                    .service-icon{
                        top: 45px;
                        left: 45px;
                    }
                    .head{
                        margin-top: 25px;
                        font-size: 16px;
                        line-height: 140%;
                    }
                }
                .service-single:last-of-type{
                    .circle{
                        margin-top: 16px;
                    }
                    .service-icon{
                        top: 30px !important;
                    }
                 }
            }
        }
        .description-one{
            .desc-left{
                padding: 30px 10% 50px 10% !important;
                width: 100% !important;
                .head{
                    font-weight: bold;
                    font-size: 28px !important;
                    line-height: 40px !important;
                }
                .desc-list{
                    margin-top: 10px;
                    .desc-item{
                        margin-top: 25px !important;
                        div{
                            margin-left: 20px !important;
                            font-size: 14px !important;
                            line-height: 140% !important;
                        }
                    }
                }
            }
            .desc-right{
                height: 200px !important;
            }
        }
        .description-two{
            padding: 30px 10% 50px 10% !important;
            .dt-top{
                .dt-header{
                    font-size: 28px;
                    line-height: 38px;
                    width: 100% !important;
                }
                .dt-sub{
                    margin-top: 15px;
                    width: 100% !important;
                    margin-left: 0 !important;
                    font-size: 14px;
                    line-height: 22px;
                }
            }
            .dt-list{
                margin-top: 10px;;
                .dt-item{
                    padding: 0 8px !important;
                    margin-right: 0 !important;
                    width: calc(100% ) !important;
                }
            }
        }
        .module{
            padding: 30px 10% 50px 10% !important;
            .module-header{
                font-size: 28px !important;
                line-height: 38px !important;
            }
            .module-sub{
                font-size: 16px;
                line-height: 22px !important;
            }
            .module-list{
                margin-top: 10px !important;
                .module-single{
                    padding: 15px !important;
                    height: 380px;
                    margin-right: 0 !important;
                    margin-top: 32px !important;
                    width: calc(100%) !important;
                    .head{
                        height: 120px;
                        margin-top: 20px;
                        font-size: 16px !important;
                    }
                }
                .module-single:nth-child(3n){
                    margin-right: 0px !important;
                }
                .module-single:nth-child(-n + 3){
                    display: none !important;
                }
            }
            .more-module{
                display: flex !important;
            }
        }
        .home-last{
            padding: 30px 10% 30px 10% !important;
            .hl-header{
                font-size: 28px !important;
                line-height: 38px !important;
            }
        }
        .footer{
            .footer-body{
                .fm-foot{
                    top: 300px;
                }
            }
        }
    }
    @media only screen and (max-width: 444px){
        .side-menu{
            .side-left{
                padding-left: 5%;
                padding-right: 5%;
                width: 80%;
            }
            .side-right{
                width: 20%;
                .side-exit{
                    right: calc(25%);
                }
            }
        }
        .contact-modal{
            .modal-body{
                height: 570px;
            }
         }
        .footer{
            .footer-body{
                .f-mid{
                    margin-top: 260px;
                }
            }
        }
    }
    @media only screen and (max-width: 339px){
        .footer{
            .footer-body{
                .f-mid{
                    margin-top: 276px;
                }
            }
        }
    }
</style>
